{
    "projects": [
        {
            "name": "Link Up vendor plugin",
            "image": "media/images/linkup_plugin.jpg",
            "description": "While studying abroad during a pandemic, I tried to find ways to engage with my future community. I found out about Link Up, a festival organisation for African and Caribbean diaspora. I volunteered online during their festival period and have been continuing my work with them by developing a Wordpress plugin. This plugin gives them a simple way to add information about 3rd party festival vendors and display them in alphabetical order, separated by category.",
            "link": "https://github.com/annetawamono/linkup-vendor-plugin",
            "type": "web",
            "stack": [
                "HTML",
                "Javascript",
                "SCSS",
                "PHP",
                "Wordpress"
            ]
        },
        {
            "name": "The Perfect Sandwich",
            "image": "media/images/Perfect_sandwhich_thumb.jpg",
            "description": "Another website that I designed and developed for school. The assignment was affectionately named 'The Perfect Sandwhich' and I went with a classic - the American cheese burger.",
            "link": "https://annetawamono.github.io/perfectsandwich/",
            "type": "web",
            "stack": [
                "Figma",
                "HTML",
                "CSS"
            ]
        },
        {
            "name": "Project Tracker Intro Component",
            "image": "media/images/desktop-preview.jpg",
            "description": "I recently discovered <b><a href='https://www.frontendmentor.io/challenges/project-tracking-intro-component-5d289097500fcb331a67d80e' target='_blank'>frontendmentors.io</a></b> and I immediately fell in love with the concept of providing high quality frontend designs for anyone to practise building them. I chose to complete the Project Tracking project as my first challenge (there will definitely be more to come). The project requirements were to build the desktop design and mobile design using any tools I saw fit. I used HTML, Sass and javascript to build my designs and I am pretty happy with the end result. However, I'm always looking for feedback from my peers which is why I like frontendmentors so much, because I can submit my build for review from other developers. I haven't built designs for a tablet view or any landscape orientations, but I will return to this project hopefully in the near future to complete it.",
            "link": "https://www.frontendmentor.io/solutions/html-sass-and-js-built-with-a-small-keyframe-animation-on-hero-image-9ew-c2YVe",
            "type": "web",
            "stack": [
                "HTML",
                "Javascript",
                "SCSS"
            ]
        }
    ]
}