{"projects":[
    {"name": "Sketch To Animate", "image": "media/images/Portfolio_cover_image.jpg", "description": "I approached Sketch To Animate LLC with a proposal for a website revamp. Starting with building a fresh, new look and offering the e-commerce functionality needed to sell online animation tutorials and tickets to workshops, my aim was to keep design and development at a budget friendly price point. What you see here is a demo of the site, built with Wordpress and Woocommerce. The design was built on top of a starter theme for time efficiency. I chose Figma for designing the UI/UX and then translated into HTML. Please note that the shop functionality has been omitted from this demo as a request from the company, but a full live version will be available soon.", "link": "http://qa-sta.annetawamono.co.za/", "type": "web"},
    {"name": "Myanmar Photo Album", "image": "media/images/myanmar.jpg", "description": "I developed this project to create a family album of a trip to Myanmar in 2017 and to experiment with engaging animations and layouts. The animations were created with anime.js.", "link": "https://annetawamono.github.io/myanmar/", "type": "web"},
    {"name": "Scimatics Homework Tracker", "image": "media/images/scihwwt.png", "description": "During my university studies, I worked for a tutoring company that provided homework assistance for high school students. I saw a need for the company to obtain an efficient way to keep track of the student’s progress and to log their homework, so I designed and developed a web app MVP for them. This was my first attempt at building an MVP for a client and I learnt a lot about using PHP and MySQL for my backend. The app was developed using a LAMP stack and it was deployed and utilised by the company.", "link": "http://scimatics.annetawamono.co.za/", "type": "web"},
    {"name": "Confidance", "image": "media/images/confidance.jpg", "description": "A Wordpress blog for dancer and writer, NeoTheGift", "link": "http://confi.dance/", "type": "web"},
    {"name": "Lost At Sea", "image": "media/images/lostatsea.jpg", "description": "A ThreeJS experiment.", "link": "https://codepen.io/annetawamono/full/OzmBNZ/", "type": "web"}
]}
